Backend/loadtest/k6/results/nginx/crud/report-2026-07-30-025627.txt
     ✓ login succeeded
     ✓ create succeeded
     ✓ rename succeeded
     ✓ dashboard succeeded
     ✓ delete succeeded

     checks.........................: 100.00% ✓ 980       ✗ 0   
     data_received..................: 761 kB  10 kB/s
     data_sent......................: 401 kB  5.5 kB/s
     http_req_blocked...............: avg=35.35µs  min=0s      med=0s      max=12.22ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=20.69µs  min=0s      med=0s      max=2.01ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=92.9ms   min=35.97ms med=82.32ms max=226.5ms p(90)=148.04ms p(95)=161.06ms
       { expected_response:true }...: avg=92.9ms   min=35.97ms med=82.32ms max=226.5ms p(90)=148.04ms p(95)=161.06ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1176
     http_req_receiving.............: avg=131.01µs min=0s      med=0s      max=1.83ms  p(90)=590µs    p(95)=658.4µs 
     http_req_sending...............: avg=12.58µs  min=0s      med=0s      max=973µs   p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=92.75ms  min=35.46ms med=82.17ms max=226.5ms p(90)=147.97ms p(95)=160.64ms
     http_reqs......................: 1176    16.070806/s
     iteration_duration.............: avg=4.06s    min=4s      med=4.06s   max=4.26s   p(90)=4.08s    p(95)=4.1s    
     iterations.....................: 196     2.678468/s
     vus............................: 1       min=1       max=20
     vus_max........................: 20      min=20      max=20